// Упражнение 10.41. Исходя из имен алгоритмов и их аргументов, опишите
// действия, выполняемые каждым и следующих библиотечных алгоритмов:

/* replace(beg, end, old_val, new_val); // Заменяет значение old_val на new_val
   в последовательности от beg до end.

   replace(beg, end, pred, new_val); // Заменяет значение, для которого предикат
   возвращает true, на new_val в последовательности от old_val до new_val.

   replace_copy(beg, end, dest, old_val, new_val); // Заменяет значение old_val
   на new_val в последовательности от beg до end и сохраняет результат в
   последовательности назначения dest. Последовательность от beg до end остается
   неизменной.

   replace_copy_if(beg, end, dest, pred, new_val) // Заменяет значение, для
   которого предикат возвращает true, на new_val в последовательности от old_val
   до new_val и сохраняет результат в последовательности назначения dest.
   Последовательность от beg до end остается неизменной.
 */