// Упражнение 14.1. Чем перегруженный оператор оличается от встроенного? В чем
// перегруженные операторы совпадают со встроенными.

// Перегруженный оператор отличтается от встроенного, тем, что первый является
// функцией, которая переопределяет поведение оператор для класса, в или для
// которого определена данная функция.

// Явным отличием является послдедовательность вычислений для определенных
// операторов. Поскольку это функция, она не сохраняется как у встроенных.

// Перегруженные операторы совпадают со встроенными в концепции знака, который
// переопределяется. Немало зависит отразработчика, но в этом сложно ошибиться.
