// Упражнение 11.2. Приведите пример того, когда наиболее полезен контейнер
// list, vector, map и set.

// list - подходит, если нужно вставлять элементы в середину контейнера. Также с
// ним удобно использовать некоторые специфические алгоритмы.

// vector - подходит для простого хранения чисел, не нужно дополнительно
// заморачиваться. Можно пользоваться всеми возможностями произвольных
// итераторов.

// map - подходит для хранения значений по ключу. К прмеру подсчет слов, или
// хранение номера телефона по имени человека.

// set - подходит для набора нежелательных объектов, с которым можно сверяться
// при определенных действиях. К примеру бан пользователей или блокировка
// ненужных слов.