// Упражнение 7.16. Каковы ограничения ( если они есть) на количество
// спецификаторов доступа в определении класса? Какие виды членов должны быть
// определены после спцификатора public? Какие после спцификатора private?

// Каковы ограничения ( если они есть) на количество спецификаторов доступа в
// определении класса?

// * Никаких. Уровень доступа будет в силе до следующего спцификатора или до
// конца тела функции.

// Какие виды членов должны быть определены после спцификатора public?

// * Конструкторы и функции-члены, отвечающие за интерфейс класса.

// Какие после спцификатора private?

// * Переменные-члены и функции-члены, отвечающие за реализацию интерфейса.